validation/denseAGFoam/verticalChannel-a01-p4/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;

        smoothLimiter   0.1;

        implicitPhasePressure yes;
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-12;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     2;
        tolerance       1e-8;
        maxIter         1000;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0;
        minIter         1;
    }

    "(h|e).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0;
        maxIter         0;
        minIter         1;
    }

    "(Theta.*|Sigma.*)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "(k|epsilon).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors            3;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    0;
    pRefCell    0;
    pRefValue   1e5;

    residualControl
    {
        "alpha.*"
        {
                tolerance   1e-8;
                relTol      0;
        }
        p_rgh
        {
                tolerance   1e-6;
                relTol      0;
        }
    }

    pRefCell        0;
    pRefValue       1e5;
}

relaxationFactors
{
    equations
    {
		p                  0.6;
		"alpha.*"          0.2;
		"Theta.*"          0.5;
		"Sigma.*"          1.0;
    }
}


// ************************************************************************* //
