validation/denseAGFoam/verticalChannel-a01-p4/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
	type            phaseIncompressibleMeanVelocityForce;
    active          on;            //on/off switch

    phaseIncompressibleMeanVelocityForceCoeffs
    {
        selectionMode   all;
        fieldNames      (U.gas);
        alphaName       alpha.gas;
        Ubar		    (0 0.5 0);
        relaxation      0.5;                    // Optional relaxation factor
    }
}


// ************************************************************************* //
